{
    "loans_data":{
        "id":"A row identifyer for the loans table. Each id is unique for each row.",
        "loan_amnt": "The listed amount of the loan applied for by the borrower.",
        "funded_amnt": "The total amount committed to the loan by the Lending Club.",
        "funded_amnt_inv": "The total amount committed by investors for the loan.",
        "int_rate": "Interest rate of the loan.",
        "installment": "The monthly payment owed by the borrower if the loan originates.",
        "grade": "Lending Club assigned loan grade.",
        "sub_grade": "Lending Club assigned sub-grade.",
        "emp_title": "The job title supplied by the borrower when applying for the loan.",
        "home_ownership": "The home ownership status provided by the borrower during registration. Values are: RENT, OWN, MORTGAGE, OTHER.",
        "annual_inc": "The self-reported annual income provided by the borrower during registration.",
        "verification_status": "Indicates if income was verified by Lending Club.",
        "loan_status": "Current status of the loan.",
        "pymnt_plan": "Indicates if a payment plan has been put in place for the loan.",
        "url": "URL for the Lending Club page with detailed information about the loan.",
        "desc": "Loan description provided by the borrower.",
        "purpose": "A category provided by the borrower for the loan request.",
        "title": "The loan title provided by the borrower.",
        "zip_code": "The first 3 numbers of the zip code provided by the borrower in the loan application.",
        "addr_state": "The state provided by the borrower in the loan application.",
        "dti": "Debt-to-income ratio calculated using the borrower’s total monthly debt payments divided by their self-reported monthly income.",
        "delinq_2yrs": "The number of 30+ days delinquencies the borrower has had in the past 2 years.",
        "earliest_cr_line": "The month and year the borrower’s earliest reported credit line was opened.",
        "fico_range_low": "The lower boundary range of the borrower’s FICO score at the time of loan origination.",
        "fico_range_high": "The upper boundary range of the borrower’s FICO score at the time of loan origination.",
        "inq_last_6mths": "The number of credit inquiries the borrower has had in the last 6 months (excluding auto and mortgage inquiries).",
        "mths_since_last_delinq": "The number of months since the borrower’s last delinquency.",
        "mths_since_last_record": "The number of months since the last public record.",
        "open_acc": "The number of open credit lines in the borrower’s credit file.",
        "pub_rec": "Number of derogatory public records, such as bankruptcy filings, tax liens, or judgments.",
        "revol_bal": "The total amount of credit revolving balances.",
        "revol_util": "Revolving line utilization rate, or the amount of credit the borrower is using relative to all available revolving credit.",
        "total_acc": "The total number of credit lines currently in the borrower’s credit file.",
        "initial_list_status": "The initial listing status of the loan. Possible values are – W, F.",
        "out_prncp": "The remaining outstanding principal for total amount funded.",
        "out_prncp_inv": "The remaining outstanding principal for portion of total amount funded by investors.",
        "total_pymnt": "Payments received to date for total amount funded.",
        "total_pymnt_inv": "Payments received to date for portion of total amount funded by investors.",
        "total_rec_prncp": "Principal received to date.",
        "total_rec_int": "Interest received to date.",
        "total_rec_late_fee": "Late fees received to date.",
        "recoveries": "Post charge off gross recovery.",
        "collection_recovery_fee": "Post charge off collection fee.",
        "last_pymnt_amnt": "Last total payment amount received.",
        "last_fico_range_high": "The upper boundary range of the borrower’s last FICO score.",
        "last_fico_range_low": "The lower boundary range of the borrower’s last FICO score.",
        "collections_12_mths_ex_med": "Number of collections in 12 months excluding medical collections.",
        "mths_since_last_major_derog": "Months since most recent 90-day or worse rating.",
        "policy_code": "Publicly available policy_code=1, new products not publicly available policy_code=2.",
        "application_type": "Indicates whether the loan is an individual application or a joint application with two co-borrowers.",
        "annual_inc_joint": "The combined annual income reported by the co-borrowers on a joint application.",
        "dti_joint": "The debt-to-income ratio calculated using the total monthly debt payments of the co-borrowers, divided by the combined self-reported monthly income of the co-borrowers, on a joint application.",
        "verification_status_joint": "Indicates if the co-borrowers’ joint income was verified by Lending Club.",
        "acc_now_delinq": "The number of accounts on which the borrower is now delinquent.",
        "tot_coll_amt": "Total collection amounts ever owed.",
        "tot_cur_bal": "Total current balance of all accounts.",
        "open_acc_6m": "Number of open trades in the last 6 months.",
        "open_act_il": "Number of currently active installment trades.",
        "open_il_12m": "Number of installment accounts opened in past 12 months.",
        "open_il_24m": "Number of installment accounts opened in past 24 months.",
        "mths_since_rcnt_il": "Months since the most recent installment account opened.",
        "total_bal_il": "Total current balance of all installment accounts.",
        "il_util": "Ratio of total current balance to high credit/credit limit on all installment accounts.",
        "open_rv_12m": "Number of revolving trades opened in past 12 months.",
        "open_rv_24m": "Number of revolving trades opened in past 24 months.",
        "max_bal_bc": "Maximum current balance owed on all revolving accounts.",
        "all_util": "Balance to credit limit on all trades.",
        "total_rev_hi_lim": "Total revolving high credit/credit limit.",
        "inq_fi": "Number of personal finance inquiries.",
        "total_cu_tl": "Number of finance trades.",
        "inq_last_12m": "Number of credit inquiries in the past 12 months.",
        "acc_open_past_24mths": "Number of accounts opened in past 24 months.",
        "avg_cur_bal": "Average current balance of all accounts.",
        "bc_open_to_buy": "Total open to buy on revolving bankcards.",
        "bc_util": "Ratio of total current balance to high credit/credit limit for all bankcard accounts.",
        "chargeoff_within_12_mths": "Number of charge-offs within  last 12 months.",
        "delinq_amnt": "The past-due amount owed for the accounts on which the borrower is now delinquent.",
        "mo_sin_old_il_acct": "Months since oldest bank installment account opened.",
        "mo_sin_old_rev_tl_op": "Months since oldest revolving account opened.",
        "mo_sin_rcnt_rev_tl_op": "Months since most recent revolving account opened.",
        "mo_sin_rcnt_tl": "Months since most recent account opened.",
        "mort_acc": "Number of mortgage accounts.",
        "mths_since_recent_bc": "Months since most recent bankcard account opened.",
        "mths_since_recent_bc_dlq": "Months since most recent bankcard delinquency.",
        "mths_since_recent_inq": "Months since most recent inquiry.",
        "mths_since_recent_revol_delinq": "Months since most recent revolving delinquency.",
        "num_accts_ever_120_pd": "Number of accounts ever 120 or more days past due.",
        "num_actv_bc_tl": "Number of currently active bankcard accounts.",
        "num_actv_rev_tl": "Number of currently active revolving trades.",
        "num_bc_sats": "Number of satisfactory bankcard accounts.",
        "num_bc_tl": "Number of bankcard accounts (credit cards issued by banks).",
        "num_il_tl": "Number of installment loan accounts (loans with fixed payments and a set maturity date).",
        "num_op_rev_tl": "Number of open revolving accounts (credit cards and lines of credit).",
        "num_rev_accts": "Number of revolving accounts.",
        "num_rev_tl_bal_gt_0": "Number of revolving trades with balance greater than zero.",
        "num_sats": "Number of satisfactory accounts.",
        "num_tl_120dpd_2m": "Number of accounts currently 120 days past due (updated in past 2 months).",
        "num_tl_30dpd": "Number of accounts currently 30 days past due.",
        "num_tl_90g_dpd_24m": "Number of accounts 90 or more days past due in last 24 months.",
        "num_tl_op_past_12m": "Number of accounts opened in past 12 months.",
        "pct_tl_nvr_dlq": "Percentage of accounts never delinquent.",
        "percent_bc_gt_75": "Percentage of bankcard accounts with credit utilization greater than 75%.",
        "pub_rec_bankruptcies": "Number of public record bankruptcies.",
        "tax_liens": "Number of tax liens.",
        "tot_hi_cred_lim": "Total high credit/credit limit (the total of the maximum amount of credit extended on all accounts).",
        "total_bal_ex_mort": "Total credit balance excluding mortgage.",
        "total_bc_limit": "Total bankcard (credit card) limit.",
        "total_il_high_credit_limit": "Total installment high credit/credit limit.",
        "revol_bal_joint": "Total revolving balance on joint accounts.",
        "sec_app_fico_range_low": "FICO range (low) for the secondary applicant.",
        "sec_app_fico_range_high": "FICO range (high) for the secondary applicant.",
        "sec_app_inq_last_6mths": "Number of credit inquiries for the secondary applicant in the last 6 months.",
        "sec_app_mort_acc": "Number of mortgage accounts held by the secondary applicant.",
        "sec_app_open_acc": "Number of open credit lines in the secondary applicant’s credit file.",
        "sec_app_revol_util": "Revolving line utilization rate, or the amount of credit the secondary applicant is using relative to all available revolving credit.",
        "sec_app_open_act_il": "Number of currently active installment trades for the secondary applicant.",
        "sec_app_num_rev_accts": "Number of revolving accounts held by the secondary applicant.",
        "sec_app_chargeoff_within_12_mths": "Number of charge-offs within the last 12 months for the secondary applicant.",
        "sec_app_collections_12_mths_ex_med": "Number of collections in 12 months excluding medical collections for the secondary applicant.",
        "sec_app_mths_since_last_major_derog": "Months since the secondary applicant’s last major derogatory event.",
        "hardship_flag": "Flags whether the borrower is on a hardship plan.",
        "hardship_type": "Type of hardship plan offered to the borrower, if any.",
        "hardship_reason": "Reason provided by the borrower for the hardship event.",
        "hardship_status": "Current status of the hardship plan.",
        "deferral_term": "The number of months that the borrower is expected to pay less than the contractual monthly payment amount due to a hardship plan.",
        "hardship_amount": "The amount of the monthly payment that the borrower must pay while under a hardship plan.",
        "hardship_length": "The length of the hardship plan in months.",
        "hardship_dpd": "Number of days past due as of the hardship plan start date.",
        "hardship_loan_status": "Loan status as of the hardship plan start date.",
        "orig_projected_additional_accrued_interest": "The original estimated total amount of additional interest the borrower will pay as a result of the hardship plan.",
        "hardship_payoff_balance_amount": "The balance amount at the time the borrower entered into a hardship plan.",
        "hardship_last_payment_amount": "The last payment amount made by the borrower before entering the hardship plan.",
        "disbursement_method": "Method by which the borrower receives their loan. Possible values are \"cash\", \"directpay\", etc.",
        "debt_settlement_flag": "Indicates whether the borrower, who has charged-off, is working with a debt settlement company.",
        "settlement_status": "The status of the borrower’s settlement plan. Possible values are \"active\", \"completed\", \"broken\", etc.",
        "settlement_amount": "The amount that the borrower has agreed to pay in a settlement plan.",
        "settlement_percentage": "The percentage of the unpaid principal balance the borrower has agreed to pay in a settlement plan.",
        "settlement_term": "The number of months the borrower will be on the settlement plan.",
        "issue_d_unix": "The date when the loan was funded, converted to Unix time.",
        "last_pymnt_d_unix": "The date of the last payment received, converted to Unix time.",
        "next_pymnt_d_unix": "The date of the next scheduled payment, converted to Unix time.",
        "last_credit_pull_d_unix": "The most recent date Lending Club pulled credit for this loan, converted to Unix time.",
        "sec_app_earliest_cr_line_unix": "Earliest credit line date for the secondary applicant, converted to Unix time.",
        "hardship_start_date_unix": "The start date of the hardship plan, converted to Unix time.",
        "hardship_end_date_unix": "The end date of the hardship plan, converted to Unix time.",
        "payment_plan_start_date_unix": "The start date of the payment plan, converted to Unix time.",
        "settlement_date_unix": "The date that the borrower agrees to the settlement plan, converted to Unix time.",
        "debt_settlement_flag_date_unix": "The date that the borrower\"s debt settlement flag was set, converted to Unix time.",
        "term_months": "The length of the loan term in months.",
        "emp_length_years": "The borrower’s length of employment in years.",
        "loan_id":"Identification nunber of the loan according to the url associated"
        },
    "metadata":{
        "Total amount funded in policy code 1": "Contains the total amount, in dollars, funded in loans with policy code 1.",
        "Total amount funded in policy code 2": "Contains the total amount, in dollars, funded in loans with policy code 2."
        },
    "descriptions":{
        "name": "The name of the element to be described",
        "full_name": "The full name of the column, as it would appear on plots",
        "type": "The type of the element, table or column",
        "location": "The table where the element is located (root if it's a table)",
        "description": "A description of the element",
        "data_type": "The type of the data that column contails, (INT, REAL, TEXT, TABLE)"
    }
    
}